### Reading and Writing data in Pandas

In [2]:
#import libraries
import pandas as pd
import numpy as np

#### 1. Reading from TEXT File

Let’s read a dataset named data.txt in the working directory.

In [4]:
# Read the file and specify the delimiter
df = pd.read_table(r"D:\demo.txt", sep=',')
# Remove leading whitespaces from the 'Name' column
df['Name'] = df['Name'].str.strip()
df

    Name  Score  Age
0  gorge     80   28
1  jimmy     85   25
2  harry     70   23
3  Dolly     90   20
4  james     75   22

#### 2 Reading from CSV

In [6]:
df=pd.read_csv("D:sentiment-analysis.csv" )
df

   Text, Sentiment, Source, Date/Time, User ID, Location, Confidence Score
0   "I love this product!", Positive, Twitter, 202...
1   "The service was terrible.", Negative, Yelp Re...
2   "This movie is amazing!", Positive, IMDb, 2023...
3   "I'm so disappointed with their customer suppo...
4   "Just had the best meal of my life!", Positive...
..                                                ...
93  "I can't stop listening to this song. It's my ...
94  "Their website is so confusing and poorly desi...
95  "I had an incredible experience at the theme p...
96                                                NaN
97                                                NaN

[98 rows x 1 columns]

#### 3  Reading from Excel

In [8]:
df = pd.read_excel("D:Sample Data.xlsx")
print(df)

    Emp Code   Employee Name      Address       City Region Department  Basic
0          1        JP Kumar  Andheri (W)     Mumbai      W   Training   6250
1          2   Anjali Thakur   Govindpuri      Delhi      N   Accounts   8750
2          3   Priya Agarwal     Sector 9      Noida      N  Marketing  11250
3          4          R Vasu       Egmore    Chennai      S        R&D  10000
4          5    Sanjay Gupta     G K - II      Delhi      N   Training  16250
5          6   Jharna Biswal    Link Road    Cuttack      E   Accounts   6400
6          7   Prakash Dutta   Elgin Road    Kolkata      E  Marketing   4500
7          8    Manisha Guha      Alipore    Kolkata      E        R&D   6275
8          9      Arjun Jain      MG Road     Mumbai      W   Training   6250
9         10    Arjun Kapoor   Kormangala  Bangalore      S   Accounts   8750
10        11           Abrar    Jayanagar  Bangalore      S  Marketing  11250
11        12     Shahid Khan     M.G Road  Mangalore      S        R&D  10000
12        13   Anupam Mishra   Govindpuri     Mysore      S   Training  16250
13        14         Ashwini     Sector 9  Mangalore      S   Accounts   6400
14        15  Prateek Babbar   North Road      Delhi      N  Marketing   4500
15        16   Sukanya Reddy      Alipore  Mangalore      S        R&D   6275
16        17     Satish Puri       Bandra     Mumbai      W  Operation   6250
17        18    Anjum Chopra        Worli     Mumbai      W        R&D   8750
18        19      Akram Khan   S P B Road       Pune      W  Operation  11250
19        20   Manish Grover   L L R Road      Noida      N   Training  10000

#### Writing Data in Pandas

To store the data in csv file You can use the to_csv method to write the dataset in csv format.

In [11]:
data = [['rajiv',26,64],['karan',26,98],['pravin',28,88],['prajkta',29.88],['ananyaa',30,78]]
df=pd.DataFrame(data,columns=['name', 'roll_no.','marks'])
df

      name  roll_no.  marks
0    rajiv     26.00   64.0
1    karan     26.00   98.0
2   pravin     28.00   88.0
3  prajkta     29.88    NaN
4  ananyaa     30.00   78.0

#### Save data to CSV File

In [13]:
df.to_csv('D:new_data.csv')

#### Save data to HTML Table

In [15]:
df.to_html('D:new_data html')

#### Copy Data

In [17]:
df.to_clipboard(sep=',')

#### Save data to JSON

In [19]:
df.to_json("D:new_data.json")

#### Save data to Excel

In [21]:
df.to_excel("D:new_data.xlsx")

#### `Save data to XML

* pip install lxml

In [24]:
df.to_xml("D:new_data.xml")